/**
 * @returns {textDay} 返回一句名言警句
 */
export const wellKnow = () => {
  const textDay = [
    {
      text: "希望是附丽于存在的，有存在，便有希望，有希望，便是光明",
      name: "鲁迅",
    },
    {
      text: "人，只要有一种信念，有所追求，什么艰苦都能忍受，什么环境也都能适应",
      name: "丁玲",
    },
    { text: "如烟往事俱忘却，心底无私天地宽", name: "陶铸" },
    {
      text: "生活真象这杯浓酒，不经三番五次的提炼呵，就不会这样可口",
      name: "郭小川",
    },
    {
      text: "集体生活是儿童之自我向社会化道路发展的重要推动力;为儿童心理正常发展的必需。一个不能获得这种正常发展的儿童，可能终其身只是一个悲剧",
      name: "陶行知",
    },
    {
      text: "这世界除了心理上的失败，实际上并不存在什么失败，只要不是一败涂地，你一定会取得胜利的",
      name: "鲁迅",
    },
    {
      text: "生活中，谅解可以产生奇迹，谅解可以挽回感情上的损失，谅解犹如一个火把，能照亮由焦躁、怨恨和复仇心理铺就的道路",
      name: "穆尼尔·纳素夫",
    },
    {
      text: "真诚的、十分理智的友谊是人生的无价之宝。你能否对你的朋友守信不渝，永远做一个无愧于他的人，这就是你的灵魂、性格、心理以至于道德的最好的考验",
      name: "马克思",
    },
    {
      text: "尊重生命尊重他人也尊重自己，是生命进程中的伴随物，也是心理健康的一个条件",
      name: "弗洛姆",
    },
    {
      text: "赏心悦目的环境可以使人心旷神怡，奋发图强的气氛可以促人奋进",
      name: "",
    },
    {
      text: "面向世界，面向未来，面向现代化，努力塑造自己良好的心理品质",
      name: "",
    },
    { text: "古语云：知人者智，知己者明", name: "" },
    { text: "良好的个性胜于卓越的才智", name: "" },
    { text: "人类的幸福与欢乐在于奋斗，而最有价值的是为理想而奋斗", name: "" },
    { text: "心如明镜台，时时勤拂拭", name: "" },
    { text: "正心以为本，修身以为基", name: "" },
    { text: "只要你有一颗平常心，就没有想不通的事", name: "" },
    {
      text: "赏心悦目的环境可以使人心旷神怡，奋发图强的气氛可以促人奋进",
      name: "",
    },
    { text: "世界上最爱你的人，就是舍得花时间陪你的人", name: "" },
    { text: "一切的成就和一切的财富都始于健康的心理", name: "" },
  ];
  const random = Math.floor(Math.random() * textDay.length + 1);
  return textDay[random];
};
